{"messages": [{"role": "system", "content": "Create a SPARQL query to retrieve values from the database for the user question"}, {"role": "user", "content": "Please tell me the RHEA ID and references for the reactions involving the D-tryptophan molecule."}, {"role": "assistant", "content": "PREFIX rhea: <http://rdf.rhea-db.org/>\n\nSELECT DISTINCT ?Reaction ?reaction_citation \nWHERE {\n    VALUES ?compound_name { \"D-tryptophan\" }\n    ?Reaction rhea:citation ?reaction_citation ;\n        rhea:side / rhea:contains / rhea:compound / rhea:name ?compound_name .\n}\nLIMIT 100\n"}]}
{"messages": [{"role": "system", "content": "Create a SPARQL query to retrieve values from the database for the user question"}, {"role": "user", "content": "What are the RHEA identifiers and references for the reactions that include the D-tryptophan molecule?"}, {"role": "assistant", "content": "PREFIX rhea: <http://rdf.rhea-db.org/>\n\nSELECT DISTINCT ?Reaction ?reaction_citation \nWHERE {\n    VALUES ?compound_name { \"D-tryptophan\" }\n    ?Reaction rhea:citation ?reaction_citation ;\n        rhea:side / rhea:contains / rhea:compound / rhea:name ?compound_name .\n}\nLIMIT 100\n"}]}
{"messages": [{"role": "system", "content": "Create a SPARQL query to retrieve values from the database for the user question"}, {"role": "user", "content": "D-tryptophan分子を含む反応のRHEA識別子および参考文献は何ですか？"}, {"role": "assistant", "content": "PREFIX rhea: <http://rdf.rhea-db.org/>\n\nSELECT DISTINCT ?Reaction ?reaction_citation \nWHERE {\n    VALUES ?compound_name { \"D-tryptophan\" }\n    ?Reaction rhea:citation ?reaction_citation ;\n        rhea:side / rhea:contains / rhea:compound / rhea:name ?compound_name .\n}\nLIMIT 100\n"}]}
